排序/没排序的 要求logn的查找----二分查找

字典序 sort(),next_permutation(begin,end) do..while..
       sort(...cmp)  cmp(s1,s2) return s1+s2>s2+s1;
---------------------------------------------------------------------------------
知道二叉树前序和中序 重建二叉树
  递归 函数 pre的范围 vin的范围
       打印 root->val

树的子结构 head head->left head->right跟子树

树的路径和为k 传参剩下的int left 递归左右 

是否是平衡二叉树

树的镜像 利用temp交换左右子树 递归交换

树的层次打印 queque边读取结点的信息 边pop();  while(!que.empty()){}

二叉搜索树的后序遍历  

----------------------------------------------------------------------------------
链表的倒数第k个结点 双指针 数组越界问题

翻转链表  三个指针 pnext储存下一个指针

合并两个排序的链表   归并排序的合并->递归

----------------------------------------------------------------------------------
回溯两道题
复杂链表复制 树和双向链表
全排序字符串和数组
二叉树后序遍历 序列化


